import React from "react";
import { ScrollView, View } from "react-native";
import DropdownList from "../DropdownList";

const Performance = ({ navigation }) => {
  const list = [
    ["Ирц", "6/10"],
    ["Даалгавар", "12/20"],
    ["Бие даалт", "7/20"],
    ["Шалгалт", "12/50"],
    ["Нэмэлт оноо", "5"],
    ["Нийт оноо", "42/100"],
  ];
  const list1 = [
    ["Лекц1", "ирсэн"],
    ["Семинар1", "ирсэн"],
    ["Лекц2", "ирсэн"],
    ["Семинар2", "ирсэн"],
    ["Лекц3", "ирсэн"],
    ["Семинар3", "ирсэн"],
    ["Лекц4", "ирсэн"],
    ["Семинар4", "ирсэн"],
    ["Лекц5", "ирсэн"],
    ["Семинар5", "ирсэн"],
    ["Лекц6", "ирсэн"],
    ["Семинар6", "ирсэн"],
    ["Лекц7", ""],
    ["Семинар7", ""],
    ["Лекц8", ""],
    ["Семинар8", ""],
    ["Лекц9", ""],
    ["Семинар9", ""],
    ["Лекц10", ""],
    ["Семинар10", ""],
    ["Нийт", "6/10"],
  ];
  const list2 = [
    ["Даалгавар 1", "100/100"],
    ["Даалгавар 2", "100/100"],
    ["Даалгавар 3", "100/100"],
    ["Даалгавар 4", "100/100"],
    ["Даалгавар 5", "/100"],
    ["Даалгавар 6", "/100"],
    ["Нийт", "12/20"],
  ];
  const list3 = [
    ["Бие даалт 1", "7/10"],
    ["Бие даалт 2", "/10"],
    ["Нийт", "7/20"],
  ];
  const list4 = [
    ["Сорил 1", "5/10"],
    ["Сорил 2", "7/10"],
    ["Улирлын шалгалт", "/30"],
    ["Нийт", "12/50"],
  ];
  return (
    <ScrollView style={{ flex: 1, backgroundColor: "#fff", padding: 10 }}>
      <DropdownList title="Нийт оноо" data={list} />
      <DropdownList title="Ирц" data={list1} />
      <DropdownList title="Даалгавар" data={list2} />
      <DropdownList title="Бие даалт" data={list3} />
      <DropdownList title="Шалгалт" data={list4} />
    </ScrollView>
  );
};

export default Performance;
